target/surefire-reports/src.test.java.featureFiles.karate04.html

<!DOCTYPE html>
<html lang="en">
  
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
    
<meta charset="utf-8">
    
<meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport">
    
<link href="res/bootstrap.min.css" rel="stylesheet" type="text/css">
    
<link href="res/karate-report.css" rel="stylesheet" type="text/css">
    
<link href="favicon.ico" rel="shortcut icon">
    
<script src="res/jquery.min.js" type="text/javascript"></script>
    <script src="res/jquery.tablesorter.min.js" type="text/javascript"></script>
    <script src="res/bootstrap.min.js" type="text/javascript"></script>
    <script src="res/karate-report.js" type="text/javascript"></script>
    
<title>src.test.java.featureFiles.karate04</title>
  
</head>
  
<body>
    
<div id="root-container">
      
<div id="leftnav">
        
<div class="nav-logo">
          
<a href="karate-summary.html">
            <img alt="Karate" src="res/karate-logo.svg">
          </a>
          
<div class="nav-count">
            
<div class="bg-success" id="nav-pass">1</div>
            
<div class="bg-danger" id="nav-fail">0</div>
          
</div>
        
</div>
        
<div id="nav-type">Scenarios</div>         
        
<div id="nav-date">2020-12-02 02:53:49 PM</div>        
      
<div class="nav-container">
<div class="nav-item passed">
<a href="#[1:5]">[1:5] SOAP API Testing </a>
</div>
</div>
</div>
      
<div id="content">
      
<div class="page-heading alert alert-primary">
<a href="karate-summary.html">Summary</a><span class="feature-label">|</span><a href="karate-tags.html">Tags</a><span class="feature-label">|</span><span class="feature-label">Feature:</span><span class="feature-name">src/test/java/featureFiles/karate04.feature</span><span class="feature-description">Karate Test suite 04 | Desc: testing soap api</span>
</div>
<div class="scenario">
<div class="scenario-heading" id="[1:5]">
<div class="heading-container">
<div class="scenario-tags">
<a class="badge badge-primary" href="karate-tags.html">soap</a>
</div>
<span class="scenario-keyword">Scenario: [1:5]</span><span class="scenario-name">SOAP API Testing </span>
</div>
<div class="scenario-time passed">ms: 966</div>
</div>
<div class="step-row">
<div class="step-container" id="1">
<div class="step-ref passed">1</div>
<div class="step-cell passed">Given url "https://www.w3schools.com/xml/tempconvert.asmx"</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="1">14:53:48.788 skipping bootstrap configuration: could not find or read file: classpath:karate-config.js</div>
<div class="step-row">
<div class="step-container" id="2">
<div class="step-ref passed">2</div>
<div class="step-cell passed">And header Content-Type = "text/xml; charset=utf-8"</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="step-row">
<div class="step-container" id="3">
<div class="step-ref passed">3</div>
<div class="step-cell passed">And request</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="3">&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
&lt;soap:Body&gt;
  &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;
    &lt;Celsius&gt;37&lt;/Celsius&gt;
  &lt;/CelsiusToFahrenheit&gt;
&lt;/soap:Body&gt;
 &lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="4">
<div class="step-ref passed">4</div>
<div class="step-cell passed">When soap action "https://www.w3schools.com/xml/CelsiusToFahrenheit"</div>
</div>
<div class="time-cell passed">903</div>
</div>
<div class="preformatted" data-parent="4">14:53:49.210 request:
1 &gt; POST https://www.w3schools.com/xml/tempconvert.asmx
1 &gt; Accept-Encoding: gzip,deflate
1 &gt; Connection: Keep-Alive
1 &gt; Content-Length: 332
1 &gt; Content-Type: text/xml; charset=UTF-8
1 &gt; Host: www.w3schools.com
1 &gt; SOAPAction: https://www.w3schools.com/xml/CelsiusToFahrenheit
1 &gt; User-Agent: Apache-HttpClient/4.5.12 (Java/1.8.0_251)
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
&lt;soap:Body&gt;&#13;
  &lt;CelsiusToFahrenheit xmlns="https://www.w3schools.com/xml/"&gt;&#13;
    &lt;Celsius&gt;37&lt;/Celsius&gt;&#13;
  &lt;/CelsiusToFahrenheit&gt;&#13;
&lt;/soap:Body&gt;&#13;
 &lt;/soap:Envelope&gt;

14:53:49.710 response time in milliseconds: 507.76
1 &lt; 200
1 &lt; Cache-Control: private, max-age=0,public
1 &lt; Content-Type: text/xml; charset=utf-8
1 &lt; Date: Wed, 02 Dec 2020 09:21:54 GMT
1 &lt; Server: Microsoft-IIS/7.5
1 &lt; Vary: Accept-Encoding
1 &lt; X-AspNet-Version: 4.0.30319
1 &lt; X-Frame-Options: SAMEORIGIN
1 &lt; X-Powered-By: ASP.NET
&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&gt;&lt;soap:Body&gt;&lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&lt;/CelsiusToFahrenheitResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="5">
<div class="step-ref passed">5</div>
<div class="step-cell passed">Then status 200</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="6">
<div class="step-ref passed">6</div>
<div class="step-cell passed">And match response contains "98.6"</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="7">
<div class="step-ref passed">7</div>
<div class="step-cell passed">* def temp = response</div>
</div>
<div class="time-cell passed">0</div>
</div>
<div class="step-row">
<div class="step-container" id="8">
<div class="step-ref passed">8</div>
<div class="step-cell passed">* print "srini", temp</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="preformatted" data-parent="8">14:53:49.726 [print] srini &lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;&#13;
  &lt;soap:Body&gt;&#13;
    &lt;CelsiusToFahrenheitResponse xmlns="https://www.w3schools.com/xml/"&gt;&#13;
      &lt;CelsiusToFahrenheitResult&gt;98.6&lt;/CelsiusToFahrenheitResult&gt;&#13;
    &lt;/CelsiusToFahrenheitResponse&gt;&#13;
  &lt;/soap:Body&gt;&#13;
&lt;/soap:Envelope&gt;</div>
<div class="step-row">
<div class="step-container" id="9">
<div class="step-ref passed">9</div>
<div class="step-cell passed">And match response //CelsiusToFahrenheitResult == "98.6"</div>
</div>
<div class="time-cell passed">1</div>
</div>
<div class="step-row">
<div class="step-container" id="10">
<div class="step-ref passed">10</div>
<div class="step-cell passed">And match responseHeaders['Server'][0] == 'Microsoft-IIS/7.5'</div>
</div>
<div class="time-cell passed">36</div>
</div>
<div class="step-row">
<div class="step-container" id="11">
<div class="step-ref passed">11</div>
<div class="step-cell passed">And match responseHeaders['Server'] == ['Microsoft-IIS/7.5']</div>
</div>
<div class="time-cell passed">6</div>
</div>
<div class="step-row">
<div class="step-container" id="12">
<div class="step-ref passed">12</div>
<div class="step-cell passed">And match responseType == 'xml'</div>
</div>
<div class="time-cell passed">2</div>
</div>
<div class="step-row">
<div class="step-container" id="13">
<div class="step-ref passed">13</div>
<div class="step-cell passed">And assert responseTime &lt;= '2000'</div>
</div>
<div class="time-cell passed">4</div>
</div>
</div>
</div>
    
</div>   
  
</body>

</html>
